{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.4.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [1, 1, 28], "dtype": "float32", "sparse": false, "ragged": false, "name": "input1"}, "name": "input1", "inbound_nodes": []}, {"class_name": "RNN", "config": {"name": "rnn_RNN1", "trainable": false, "batch_input_shape": [null, 1, 28], "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": true, "unroll": false, "time_major": false, "cell": {"class_name": "StackedRNNCells", "config": {"name": "stacked_rnn_cells_StackedRNNCells1", "trainable": true, "dtype": "float32", "cells": [{"class_name": "LSTMCell", "config": {"name": "lstm_cell_LSTMCell1", "trainable": false, "dtype": "float32", "units": 300, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": null, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": null}}]}}}, "name": "rnn_RNN1", "inbound_nodes": [[["input1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_Dense1", "trainable": true, "dtype": "float32", "units": 12, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_Dense1", "inbound_nodes": [[["rnn_RNN1", 0, 0, {}]]]}], "input_layers": [["input1", 0, 0]], "output_layers": [["dense_Dense1", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_Dense1/kernel", "shape": [300, 12], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -5.270661236258114, "scale": 0.04023405523861156, "original_dtype": "float32"}}, {"name": "dense_Dense1/bias", "shape": [12], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9920207023620606, "scale": 0.007294269870309269, "original_dtype": "float32"}}, {"name": "rnn_RNN1/RNNCell_0/kernel", "shape": [28, 1200], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -3.4576521592981675, "scale": 0.02834141114178826, "original_dtype": "float32"}}, {"name": "rnn_RNN1/RNNCell_0/recurrent_kernel", "shape": [300, 1200], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -3.154548267289704, "scale": 0.021314515319525027, "original_dtype": "float32"}}, {"name": "rnn_RNN1/RNNCell_0/bias", "shape": [1200], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.9087442407421038, "scale": 0.01307359069001441, "original_dtype": "float32"}}]}]}
